#include "led.h"
/**************************************************************************
函数功能：LED接口初始化
入口参数：无 
返回  值：无
**************************************************************************/
void LED_Init(void)
{
RCC->APB2ENR|=1<<2; //使能 PORTA 时钟  
GPIOA->CRH&=0XFFF0FFFF;
GPIOA->CRH|=0X00030000;//PA12 推挽输出
GPIOA->ODR|=1<<12; //PA12 输出高
}

/**************************************************************************
函数功能：LED闪烁
入口参数：闪烁频率 
返回  值：无
**************************************************************************/
void Led_Flash(u16 time)
{
	  static int temp;
	  if(0==time) LED=0;
	  else		if(++temp==time)	LED=~LED,temp=0;
}
